#отличие методов класса 
# обычный (первый аргумент self)
# классовый (первый аргумент cls)
# статический (нет аргументов)

class Demo:
    class_var =0 
    def instant_method(self):
        self.class_var = 1 #меняет состояние экземпляра класса(создаёт атрибут)

    @classmethod
    def class_metod(cls):
        cls.class_var =2 
    
    @staticmethod
    def statick_metod():
        return "Букшин проспал"
    
# в сервисной логике в контекте django
"""
Метод не хранит состояние ему не нужен self
он принимает Параметы и возращает результаты не изменяя сам сервис
- вызыватся без создания экземпляра 
"""

#методы
"""
обычный метод экземплярный - получает self ссылку на конкретный обьект
он может менять состояние толбко экземпляра (все атрибуты)
другие экземпляры того же класса не изменяется если намеренно не меняет 
"""

"""
классовый метод(@classmethod) получает cls - сылку на сам класс
он может менять атрибуты класса и тогда увидяет изменения все экземпляры класса
"""

"""
статический метод - не получает не self не может ментяь состояние экземпляра 
ни состояния класса
"""